## Time_Decorator

In [19]:
import time

def log_time(any_func):
    def wrapper(*args, **kwargs):
        ts = time.time()
        result = any_func(*args, **kwargs)
        te = time.time()
        final = (te - ts)
        print('Final_time :',final)
    return wrapper

In [20]:
@log_time
def square(n):
    sq = [i**2 for i in range(n)]

In [21]:
square(10000)

Final_time : 0.006993293762207031

## matched and mismatched entries

In [22]:
import pandas as pd
 
df1 = pd.DataFrame({'City': ['New York', 'Chicago', 'Tokyo', 'Paris','New Delhi'],
                     'Temp': [59, 29, 73, 56,48]})
 
df2 = pd.DataFrame({'City': ['London', 'New York', 'Tokyo', 'New Delhi','Paris'],
                     'Temp': [55, 55, 73, 85,56]})

In [23]:
df1

        City  Temp
0   New York    59
1    Chicago    29
2      Tokyo    73
3      Paris    56
4  New Delhi    48

In [24]:
df2

        City  Temp
0     London    55
1   New York    55
2      Tokyo    73
3  New Delhi    85
4      Paris    56

In [25]:
df3 = pd.merge(df1,df2, how='outer', on = 'City')

In [26]:
df3

        City  Temp_x  Temp_y
0   New York    59.0    55.0
1    Chicago    29.0     NaN
2      Tokyo    73.0    73.0
3      Paris    56.0    56.0
4  New Delhi    48.0    85.0
5     London     NaN    55.0

In [27]:
matched_df1_f2 = df3.dropna()
matched_df1_f2

        City  Temp_x  Temp_y
0   New York    59.0    55.0
2      Tokyo    73.0    73.0
3      Paris    56.0    56.0
4  New Delhi    48.0    85.0

In [34]:
mismatched_df1_df2 = df3[df3.isna().any(axis=1)]
mismatched_df1_df2

      City  Temp_x  Temp_y
1  Chicago    29.0     NaN
5   London     NaN    55.0